Repository: KhaledAlhelwane/ICA
Catalog: ICA/ICA/Resources/Views/Home/*.*.resx
Languages: hr

source: Department of Human Resources
hr: قسم الموارد البشرية

source: First: The CV (Curriculum Vitae)
hr: أولاً: السيرة الذاتية

source: Hr
hr: الموارد البشرية

source: Note: Please use a computer when submitting your CV to ensure that the personal photo is uploaded correctly.
hr: ملاحظة يرجى استخدام الكمبيوتر عند إدخال السيرة الذاتية وذلك للتأكد من رفع الصورة الشخصية

source: Our Facebook page
hr: صفحتنا غى الفيسبوك

source: Second: Applying for the job
hr: ثانياً: التقدم الى العمل

source: The CV is submitted through the following link, and it will be kept in the Human Resources department
hr: يتم ادخال السيرة الذاتية عن طريق الرابط التالي وسـيـتــمّ الاحـتـفـاظ بالسـيـرة الـذاتـيـة فـي قـسـم المـوارد البـشريـة

source: The link to submit your CV
hr: رابط السيرة الذاتية

source: This is done by entering your name and some information that matches what was entered in the first stage through the job link advertised on our Facebook page.
hr: ويتم ذلك عن طريق إدخال اسمك وبعض المعلومات والتي تكون متطابقة مع ما تم إدخاله في المرحلة الأولى في رابط الوظيفة المعلنة على صفحة الفيس بوك

source: We announce job vacancies and available volunteer opportunities through our Facebook page. When there is an opportunity that matches your skills and experience, you can apply by following these steps
hr: يتم الإعلان عن الوظائف الشاغره وفرص التطوع المتوفرة عن طريق صفحتنا على الفيس بوك وعند توفر فرصة متناسبة مع مهاراتك وخبرتك, يمكنك التقديم من خلال إتباع الخطوات التالي
