Repository: KhaledAlhelwane/ICA
Catalog: ICA/ICA/Resources/Views/Home/About.*.resx
Languages: ar

source: About us
ar: عنا

source: Discover the Islamic Charity Association in Homs, providing educational, social, and humanitarian services since 1921. Our vision is to create a compassionate society where individuals support each other, and our policy includes providing material and moral support, developing skills and performance, raising awareness, and implementing projects that contribute to the community's growth. Join us in making a positive impact.
ar: إكتشف عن الجمعية الخير الإسلامية في حمص، التي تقدم الخدمات التعليمية والاجتماعية والإنسانية منذ عام 1921. رؤيتنا هي خلق مجتمع متعاطف حيث يدعم الأفراد بعضهم البعض، وتتضمن سياساتنا توفير الدعم المادي والمعنوي، وتطوير المهارات والأداء، ورفع الوعي، وتنفيذ المشاريع التي تساهم في نمو المجتمع. انضم إلينا لتحقيق تأثير إيجابي.

source: is to be a leading national institution that supports the national economy and plays a tangible and effective role in the development and advancement of society. The institution aims to achieve solidarity and cooperation among its members, while contributing to the overall growth and progress of the community.
ar: إن رؤية عون للإغاثة والتنمية تتمثل في أن نكون مؤسسة وطنية رائدة تدعم الاقتصاد الوطني وذات دور ملموس وفعال في تنمية وتطوير المجتمع وتحقيق التكافل والتعاضد بين أبناءه.

source: is to strive towards a compassionate society where individuals support each other. We are committed to delivering humanitarian aid to those in need, regardless of their political, religious, or sectarian affiliations.
ar: نحو مجتمع متكافل يعضد بعضه بعضاً. نحن حريصون على إيصال المساعدات الإغاثية والإنسانية إلى مستحقيها دون النظر إلى الانتماء السياسي أو الديني أو الطائفي.

source: Providing material and moral support to affected families.Developing the skills and performance of displaced individuals by providing vocational training and assisting them in finding employment opportunities.Raising awareness and providing psychological and educational support that contributes to improving the behavior of individuals in the community.Implementing projects that contribute to the development of the community, create new job opportunities, and promote its growth.
ar: تقديم يد العون والمساعدة (المادية والمعنوية) للعائلات المتضررة. تطوير مهارات وأداء الأفراد النازحين بتقديم التدريب المهني لهم ومساعدتهم لإيجاد فرص عمل لهم. نشر الوعي وتقديم الدعم والتأهيل النفسي والتربوي بما يساهم في تقويم سلوكيات أفراد المجتمع. تنفيذ مشاريع تساهم في تنمية المجتمع وتطويره وتخلق فرص عمل جديدة. التطوير المستمر لأداء الموظفين داخل المؤسسة واستخدام أفضل أساليب وطرق العمل.

source: The main achievements of Islamic Charity Association was the establishment of exemplary charity schools (elementary, preparatory, and secondary education), in addition to an orphanage and the Zenobia hall for conferences and celebrations. Lastly but not least, the 'Aoun Relief and Development Project' was launched, as a result of changes that occurred in the social structure of the city of Homs. The project aims to meet the needs of displaced persons and affected families, providing them with dignified accommodation until they can safely return to their homes and neighborhoods with the permission of the Almighty.
ar: وكان من منجزاتها المدارس الخيرية النموذجية (تعليم أساسي وإعدادي وثانوي) بالإضافة إلى دار الأيتام وقاعة زنوبيا للمؤتمرات والاحتفالات، وأخيراً وليس آخراً مشروع عَون للإغاثة والتنمية. حيث تم إطلاق عَون للإغاثة والتنمية وذلك نتيجة التغيرات التي طرأت على بنية المجتمع في مدينة حمص حيث نقوم بتلبية احتياجات النازحين والعائلات المنكوبة بما يكفل لهم إقامة كريمة إلى حين عودتهم سالمين آمنين إلى منازلهم وأحيائهم بإذنه جل جلاله.

source: The message of Aoun Relief and Development
ar: رسالة عَـــون للإغاثة والتنمية

source: The policy of Aoun Relief and Development includes the following
ar: سياسة عَـــون للإغاثة والتنمية

source: The vision of Aoun Relief and Development
ar: رؤية عَـــون للإغاثة والتنمية

source: Welcome to Islamic Charity Association Stablished Since 1921
ar: أهلا بك في الجمعية الخيرية الإسلامية التي تأسست عام 1339هـ الموافق لعام 1921م
