Repository: KhaledAlhelwane/ICA
Catalog: ICA/ICA/Resources/Views/Home/Index.*.resx
Languages: ar

source: A charitable association founded in 1339 AH corresponding to 1921 AD. Among its achievements were exemplary charitable schools (preparatory, primary, and secondary education), in addition to the orphanage and Zenobia Hall for conferences and celebrations, and last but not least, the Aoun Project for Relief and Development
ar: جمعية خيرية تأسست عام 1339هـ الموافق لعام 1921م وكان من منجزاتها المدارس الخيرية النموذجية (تعليم أساسي وإعدادي وثانوي) بالإضافة إلى دار الأيتام وقاعة زنوبيا للمؤتمرات والاحتفالات، وأخيراً وليس آخراً مشروع عَون للإغاثة والتنمية

source: At the Islamic charity association, we believe in the power of collaboration and our partnerships have enabled us to make significant strides in achieving our mission.
ar: تؤمن الجمعية الخيرية الإسلامية بقوة التعاون وقد مكنتنا شراكاتنا من اتخاذ خطوات كبيرة في تحقيق مهمتنا.

source: Be With Us
ar: انضم معنا

source: Become A Volunteer
ar: التطوع

source: beneficiary satisfaction
ar: رضا المستفيدين

source: Donate Now
ar: قسم التبرعات

source: Donation
ar: التبرعات

source: Donation department
ar: قسم التبرعات

source: Events will be updated soon...
ar: ...الأحداث سيتم تحديثها قريباً

source: Excellent
ar: ممتازة

source: Fair
ar: مقبولة

source: Famlies in Homs,Syria
ar: عائلة في مدينة حمص وريفها

source: Good
ar: جيدة

source: Home page-Islamic Charity Association
ar: الصفحة الرئيسية-الجمعية الخيرية الاسلامية - عون للإغاثة والتنمية

source: human resources
ar: قسم الموارد البشرية

source: Islamic Charity Association
ar: الجمعية الخيرية الإسلامية

source: Make Donation
ar: المساهمة

source: Media Center
ar: المركز الإعلامي

source: more blogs...
ar: ...المزيد من الأخبار

source: more Events...
ar: ...المزيد من الأحداث

source: Our achievements
ar: منجزاتنا

source: Our Latest Events
ar: آخر الأحداث

source: Our Partnars
ar: شركائنا

source: Please provide your feedback
ar: يرجى تقديم ملاحظاتك

source: Poor
ar: غير ذلك

source: Read
ar: إقرأ

source: Recent from blog
ar: آخر الأخبار

source: Served Over
ar: تم تخديم أكثر من

source: Sponsorship
ar: الرعاية

source: The colaborated projects
ar: البرامج والمشاريع المشتركة

source: The Islamic Charity Association in Homs is a leading institution offering education and relief services. Founded in 1921, the association operates exemplary schools, an orphanage, and a conference hall. Its 'Aoun Relief and Development Project' provides temporary housing for displaced families, while other projects support families and the wider community.
ar: الجمعية الخيرية الإسلامية في حمص هي مؤسسة تقدم خدمات التعليم والإغاثة. تأسست في عام 1921 وتمتلك مدارس الخيرية ودارًا للأيتام وقاعة مؤتمرات. وقد أطلقت الجمعية مشروع 'عون للإغاثة والتنمية' لتوفير مساكن مؤقتة للعائلات النازحة حتى يتمكنوا من العودة إلى منازلهم بأمان بالإضافة إلى العديد من المشاريع التي تدعم العائلات والمجتمع.

source: The News will be updated soon...
ar: ...ًسيتم تحديث الأخبار قريبا

source: Together, we can achieve great things. Please consider making a donation today.
ar: "وَمَا تُنفِقُوا مِن شَيْءٍ فِي سَبِيلِ اللَّهِ يُوَفَّ إِلَيْكُمْ "

source: Vote
ar: تصويت

source: Welcome
ar: مرحبا

source: Your opinion of the services provided by the association and its branches
ar: رأيكم في الخدمات المقدمة من الجميعة وفروعها

source: Your talents and passion are needed to further our important work.Volunteer,Work with us today.
ar: "والله في عون العبد ما كان العبد في عون أخيه"

source: “Always give without remembering and always receive without forgetting.” -Brian Tracy
ar: العطاء دون حب لا قيمة له

source: “Indeed, all bounty is in the Hands of Allah—He grants it to whoever He wills. And Allah is All-Bountiful, All-Knowing.-He chooses whoever He wills to receive His mercy. And Allah is the Lord of infinite bounty.” Ali 'Imran 3:73,3:74
ar: قُلْ إِنَّ ٱلْفَضْلَ بِيَدِ ٱللَّهِ يُؤْتِيهِ مَن يَشَآءُ ۗ وَٱللَّهُ وَٰسِعٌ عَلِيمٌۭ - يَخْتَصُّ بِرَحْمَتِهِۦ مَن يَشَآءُ ۗ وَٱللَّهُ ذُو ٱلْفَضْلِ ٱلْعَظِيمِ

source: “The best way to find yourself is to lose yourself in the service of others.” – Gandhi
ar: وَاللهُ فِي عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِي عَوْنِ أَخِيهِ

source: “We ourselves feel that what we are doing is just a drop in the ocean. But the ocean would be less because of that missing drop.” Mother Teresa
ar: كَمَثَلِ حَبَّةٍ أَنبَتَتْ سَبْعَ سَنَابِلَ
