Repository: KhaledAlhelwane/ICA
Catalog: ICA/ICA/Resources/Views/Home/Projects.*.resx
Languages: ar

source: A brief timeline of our 10 years effort with our partners
ar: جدول زمني موجز لعشر سنين من الجهود المتظافرة مع شركائنا

source: cleanliness
ar: النظافة

source: Distribution of Food Baskets
ar: توزيع السلات الغذائية

source: Food aid
ar: الدعم الغذائي

source: Generations of Tomorrow
ar: أجيال الغد

source: Income-Generating Equipment Project
ar: مشروع المعدات المدرة للدخل

source: Medical clinic
ar: عيادة طبية

source: Our History
ar: تاريخ الجمعية الحافل

source: Our life is hope
ar: حياتنا أمل

source: Projects
ar: مشاريعنا

source: Providing Education Services in the Northern Countryside
ar: تقديم خدمات التعليم في الريف الشمالي

source: Social care
ar: الرعاية الإجتماعية

source: String1
ar: جدول زمني موجز لعشر سنين من الجهود المتظافرة مع شركائنا

source: The Back to Learning Campaign
ar: حملة العودة للتعليم

source: The detergent factory
ar: معمل النظافة

source: The educational project
ar: المشروع التعليمي

source: The medical project
ar: المشروع الطبي

source: The mettle for Youth Participation and Development
ar: همة مشاركة و نماء الشباب اليافع

source: The natural breastfeeding campaign
ar: حملة الإرضاع الطبيعي

source: The non-food aid project
ar: مشروع المساعدات الغير غذائية

source: Women's development
ar: تنمية المرأة
