Repository: KhaledAlhelwane/ICA
Catalog: ICA/ICA/Resources/Views/Shared/_MainLayout.*.resx
Languages: ar

source: About
ar: عنا

source: Al-Maytam Street, Al-Waer neighborhood, Homs, Syria
ar: شارع الميتم حي الوعر، حمص ، سوريا

source: Alwaleed
ar: الوليد

source: Aoun
ar: عون

source: Aoun Mall
ar: مول عون

source: Association Projects
ar: مشاريع ذاتية

source: association structure
ar: هيكلية الجمعية

source: Blog
ar: المدونة

source: Contact
ar: تواصل معنا

source: Current projects
ar: مشاريع حالية

source: Email System
ar: نظام البريد الإلكتروني

source: Events
ar: أحداث

source: External
ar: خارجيين

source: Halls
ar: الصالات

source: Have a Questions?
ar: في حال وجود أي إستفسار

source: High school
ar: الثانوية

source: Home
ar: الرئيسية

source: ICA
ar: الجمعية الخيرية الإسلامية

source: Internal
ar: داخليين

source: main projects
ar: مشاريعنا الأساسية

source: Menu
ar: القائمة

source: Middle school
ar: الإعدادية

source: News
ar: أخبارنا

source: Old Projects
ar: مشاريع سابقة

source: own project
ar: مشروع عون

source: Primary school
ar: الإبتدائية

source: Projects
ar: مشاريعنا

source: Schools
ar: المدارس

source: sections
ar: أقسامنا

source: Site Links
ar: روابط مفيدة

source: Social care project
ar: مشروع الرعاية الإجتماعية

source: The detergent factory
ar: معمل النظافة

source: The Islamic Charity Association in Homs is a significant institution that offers education and relief services. It was established in 1921 and has exemplary schools, an orphanage, and a conference hall. the association has launched the 'Aoun Relief and Development Projesocietyct' to provide temporary housing for displaced families until they can return home safely in addition to many projects that support families and the socity.
ar: مؤسسة تعليمية وإغاثية مهمة في مدينة حمص. تأسست في عام 1921 وتضم مدارسًا نموذجية للتعليم الأساسي والإعدادي والثانوي، بالإضافة إلى دار للأيتام وقاعة للمؤتمرات والاحتفالات. وقد تم إطلاق مشروع عَون للإغاثة والتنمية لتلبية احتياجات النازحين والعائلات المنكوبة حتى يتمكنوا من العودة إلى منازلهم بأمان وسلامة بالإضافة الى العديد من المشاريع التي تدعم الأسر والمجتمع

source: The orphanage
ar: الميتم

source: UN projects
ar: مشاريع أممية

source: WFP Relief Project
ar: مشروع الإغاثة WFP

source: Zenobia
ar: زنوبيا
